/// প্রশ্ন: n কি মৌলিক সংখ্যা?
/*
মৌলিক সংখ্যা:  যে সংখ্যাকে অন্য কোন সংখ্যা দ্বারা ভাগ করা যায় না, তাকে মৌলিক সংখ্যা বলে

প্রথম ছাব্বিশটি মৌলিক সংখ্যা হল: ২, ৩, ৫, ৭, ১১, ১৩, ১৭, ১৯, ২৩, ২৯, ৩১, ৩৭, ৪১, ৪৩, ৪৭,
                                                    ৫৩, ৫৯, ৬১, ৬৭, ৭১, ৭৩, ৭৯, ৮৩, ৮৯, ৯৭, ১০১

                   49 -> 7, 20 is not prime

*/
#include<stdio.h>
int main()
{
    int n = 53;
    int flag = 0;
    for(int i = 2; i*i <= n; i++){
        if(n%i == 0){
            flag = 1;
            break;
        }
    }
    if(flag == 1){
        printf("%d is not prime\n", n);
    }
    else {
        printf("%d is prime\n", n);
    }

    return 0;
}
